Revit 2027 API
MEPCalculationServerInfo(IExternalServer) Constructor
 Create a new MEPCalculationServerInfo by an external server.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPCalculationServerInfo(
	IExternalServer server
)
Public Sub New (
	server As IExternalServer
)
public:
MEPCalculationServerInfo(
	IExternalServer^ server
)
new :
        server : IExternalServer -> MEPCalculationServerInfo
Parameters
server IExternalServer
 The external server.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MEPCalculationServerInfo Class
MEPCalculationServerInfo Overload
Autodesk.Revit.DB Namespace